{
  "content": "<h3>Repair Risks</h3> <p>Electronic repairs are unpredictable. Your device may be beyond repair or may be permanently damaged during repair and rendered useless. Circuit board components deteriorate over time and can fail without warning especially on liquid damage devices where components can short circuit, oxidize, corrode and rust over time.</p> <p>Repairs on devices with glued-on screens such as iPads involve prying the screen to access internal components. Screens are very delicate and can crack or break during the prying process. We are highly experienced and the risk of screen breaking is minimal, but glass can break and risks do exist.</p> <p>Touch id / Face id on apple devices may fail during repair and deemed unusable. Although this is not common, it can happen depending on the device condition.</p> <p>Integrated GPU on laptops and AIO computers can fail without warning especially on older devices such as 2011 MacBooks / iMacs. HP, Dell, Toshiba, and other devices with known GPU problems of any year make and model.</p> <h3>Estimates</h3> <p>While we try to be as thorough as possible with all estimates, we do not guarantee that our estimate is all-inclusive and final. Often, it is very difficult or impossible to identify every problem affecting a device until some work is performed. Our estimates may evolve or change during the course of servicing your device. If our technicians need to update the estimate, we will let you know as soon as possible we continue the service. All changes <strong>MUST</strong> be approved by you before we move on with any work. Our initial estimate will always remain valid within the scope of the services it was originally attached to, though we may advise you that the original service may have become unnecessary or unlikely to resolve the issue.</p> <h3>Limited Shop Warranty</h3> <p>We offer a 60-day warranty on all repairs. If for any reason an issue from the original work order recurs within 60 days, we will perform the service again at no extra charge. All parts used to service your device is also guaranteed for 60 days from the date of the service. The guarantee does not cover issues that may develop within the guarantee period that are not related to services performed or to the original issue or symptom diagnosed and repaired.</p> <p>Recurrence of original symptoms or issues caused by user error or negligence in the 30-day guarantee period, including but not limited to physical damage (drops, crushing, exposure to temperature extremes), liquid damage (spills on and liquid immersion of the device), electrical damage (improper grounding, contact with poorly performing or damaged electrical networks), and damage caused through installation or use of harmful software components (viruses, malware, spyware), voids the Tecom Advance Limited Shop Warranty.</p> <p><strong>NOTE:</strong> If your device is physically tampered with or damaged within the warranty period, the Tecom Advance Warranty is void. This includes but is not limited to cracked screens, dents to the casing, internal damage not present at time of original repair, attempts to open or modify the device, using non original charging cables to charge your device, or any other action, accidental or intentional, that could cause our repair to fail.</p> <p>Some services performed by Tecom Advance may void your manufacturer's warranty. By accepting service from Tecom Advance, you understand and agree that we are not held liable for voiding your device manufacturers warranty.</p> <h3>Warranty Exclusions</h3> <p>We do not offer warranties or guarantees, explicit or implicit, on any of the following:</p> <ul> <li>Any service using parts not purchased through Tecom Advance.</li> <li>Any software issues, including virus removal, Operating system installation.</li> <li>New symptoms/issues not directly tied to the original service within the 60-day guarantee period.</li> <li>Installing new hardware or modifying existing hardware in the 60-day guarantee period voids the Tecom Advance.</li> </ul> <h3>Warranty Repairs</h3> <p>No refunds. If your device malfunctions or fails within 60 days from the time that you received the device, we will perform the repair again at no extra cost to you. The issue must be related to the original work order. If the issue is unrelated, you will be notified about repair cost before wemove forward with the repair. No refunds are issued before we attempt the repair again so we can verify the validity of the claim. Refunds are only issued if we are not able to fix your device minus the repair attempt fee. See repair attempt fee section of our terms for more details. If your device qualifies for the warranty repair, you are responsible for shipping the device back to us and we will cover return shipping.</p> <h3>Estimate and Repair Time</h3> <p>We pride ourselves on the speed of our repairs, however many of the factors that determine the length of your repair are beyond our control. As such, we will attempt to service your device as soon as possible in the order it was received. Many of our repairs are completed in 1-48 hours, however we offer no guarantees of how long the service will take. Any references to service times on our website or in promotional materials are our best estimates based on previous experience and are not meant to represent an exact time frame or offer any guarantees of service time.</p> <h3>Replacement Parts Procedure</h3> <p>If a service requires parts to complete, we will contact and inform you of the need prior to ordering any parts. We will explain the part needed, why it’s necessary, any associated costs, and give an estimate of when the part will likely arrive. Due to shipping times being beyond our control, our estimate is a best guess and is not intended to guarantee arrival by a specific time. If you would like to hold on to your device until parts come in, a <strong>non-refundable deposit of 50%</strong> of the cost of the ordered parts will be required. Tecom Advance will generally not use parts not purchased by Tecom Advance. This is due to our inability to verify that the parts are functional and will provide a good fit for your device. Any replacement parts not supplied by Tecom Advance are not covered by any kind of warranty or guarantee except as might be provided by the part manufacturer. By providing your own parts, you acknowledge that you understand and agree that any work we provide is not covered by the Tecom Advance Shop Warranty or any other guarantee or assurance, explicit or implicit. You also agree to waive any liability for damage to your device caused by faulty parts or other part incompatibilities.</p> <h3>Repair Attempt Fee</h3> <p>We charge a repair attempt fee for All devices that involve motherboard repairs, data recovery or devices that had prior repair attempts. If repair is unsuccessful or data recovery is not possible, or the device was previously worked on before it arrived at our shop you will be charged a <strong>repair attempt fee</strong> ranging from <strong>KES 1000 - KES 5000</strong> to cover the time spent working on your device.</p> <h3>Shipping Policy</h3> <p>The shipping instructions that you provide upon filling in your mail in form, are the instructions we follow to ship your items. Failure to request insurance, renders any shipping damages solely the responsibility of the customer and Tecom Advance assumes no liability in case of damages during shipping. Furthermore, devices not shipped in their original packages are more prone to damage during shipping; if you send us your device in a generic box, we will ship it back to you in a generic box at your own risk. If you are providing your own shipping label, be sure to include insurance on it if you wish to do so; we are unable to provide insurance to pre-purchased labels.</p> <h3>Data</h3> <p>Tecom Advance does not guarantee the security or safety of your data. While we take every precaution possible to make sure the integrity of your data is unaffected, we cannot assume liability for any lost data as a result of services performed by Tecom Advance.</p> <p>If we are aware that a procedure may result in loss of data, we will inform you of the possibility, what data may be affected, and will offer to back your data up at an additional cost. However, due to the complex nature of electronic devices, we cannot in advance predict what may happen to your data in every situation. We strongly encourage you to back up any important files and documents before you drop off or mail in your device for service.</p> <h3>Pickup time limit and storage</h3> <p>Due to our limited storage capacity, we will hold on to devices for up to 60 days after we contact you to pick up your device. After the 60 days period, if we have not heard from you, we will consider your device abandoned and Tecom Advance will have the right to sell the device to recover service cost and parts used to fix your device, or we’ll recycle the device if it’s none functional. We cannot guarantee that your equipment will not be discarded after the initial 60day period, so it is critical that you pick up your equipment on time or make arrangements with Tecom Advance to store your equipment until you can pick it up. If you make arrangements to pick up after 60 days, you will be billed at KES 1800 a month for storage.</p> <br><br> <p>By Accepting and Submitting this form, you are agreeing to the terms mentioned here and understand the risks involved. You also acknowledge that Tecom Advance will not be held responsible for any damage your device sustains or Data loss as a result of the repair. If your device powers on, we highly recommend that you backup your data before you ship it to us.</p>"
}
